workstation/openfoam-master-tutorials/tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<constant>/caseSettings"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    innerInlet
    {
        type            fixedValue;
        value           uniform $:innerInlet.U;
    }

    outerInlet
    {
        type            fixedValue;
        value           uniform $:outerInlet.U;
    }

    outlet
    {
        $:outlet.U;
    }

    staticWalls
    {
        $:wall.U;
    }

    movingWalls
    {
        $:movingWall.U;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
